src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Адресная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧПокупатели</name>
    <attributes>
      <name>Покупатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто</comment>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/CommonModules/ВыводПечатныхФорм/Module.bsl
#Область Изображения

Процедура РассчитатьРазмерИРасположениеКартинки(Картинка, Знач Ширина, Знач Высота, Знач Верх, Знач Лево, Знач МасштабПечати = Неопределено, МасштабКартинки = 100) Экспорт
	// Рассчитываем размеры относительно масштаба картинки
	Ширина = Ширина / 100 * МасштабКартинки;
	Высота = Высота / 100 * МасштабКартинки;
	// Рассчитаем размеры относительно масштаба печати
	Если МасштабПечати <> Неопределено Тогда 
		Ширина = Ширина * 100 / МасштабПечати;
		Высота = Высота * 100 / МасштабПечати;
		Верх = Верх * 100 / МасштабПечати;		
		Лево = Лево * 100 / МасштабПечати;		
	КонецЕсли;
	// Рассчитаем положение относительно низа картинки
	Верх = Верх - Высота;
	// Устанавливаем значения
	Картинка.Верх = Верх;
	Картинка.Лево = Лево;
	Картинка.Ширина = Ширина;
	Картинка.Высота = Высота;	
КонецПроцедуры

// Подставляет логотип организации в рисунок области макета: в рисунок с именем «Логотип»,
// а если его нет - в первый рисунок области.
//
// Параметры:
//  Область - ТабличныйДокумент - область макета с рисунком под логотип.
//  Логотип - ХранилищеЗначения, ДвоичныеДанные, Неопределено - логотип организации
//            (реквизит Организации.Логотип); при пустом значении рисунок не меняется.
//
Процедура УстановитьЛоготип(Область, Логотип) Экспорт
	Рисунок = Область.Рисунки.Найти("Логотип");
	Если Рисунок = Неопределено И Область.Рисунки.Количество() > 0 Тогда
		Рисунок = Область.Рисунки[0];
	КонецЕсли;
	Если Рисунок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Данные = ?(ТипЗнч(Логотип) = Тип("ХранилищеЗначения"), Логотип.Получить(), Логотип);
	Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
		Рисунок.Картинка = Новый Картинка(Данные);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Разное

Функция СформироватьТабличныеДанные(ТЗТовары) Экспорт
	Если ТЗТовары.Колонки.Найти("Серия") = Неопределено Тогда
		ТЗТовары.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗ.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
	                      |	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗ.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ВЫРАЗИТЬ(ТЗ.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	                      |	ВЫРАЗИТЬ(ТЗ.Упаковка КАК Справочник.УпаковкиЕдиницыИзмерения) КАК Упаковка,
	                      |	ВЫРАЗИТЬ(ТЗ.КоличествоУпаковок КАК ЧИСЛО) КАК КоличествоУпаковок,
	                      |	ВЫРАЗИТЬ(ТЗ.Количество КАК ЧИСЛО) КАК Количество,
	                      |	ВЫРАЗИТЬ(ТЗ.Цена КАК ЧИСЛО) КАК Цена,
	                      |	ВЫРАЗИТЬ(ТЗ.Сумма КАК ЧИСЛО) КАК Сумма,
	                      |	ВЫРАЗИТЬ(ТЗ.СуммаСНДС КАК ЧИСЛО) КАК СуммаСНДС,
	                      |	ВЫРАЗИТЬ(ТЗ.СтавкаНДС КАК Справочник.СтавкиНДС) КАК СтавкаНДС,
	                      |	ВЫРАЗИТЬ(ТЗ.СуммаНДС КАК ЧИСЛО) КАК СуммаНДС
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	&ТЗ КАК ТЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.НомерСтроки КАК НомерСтроки,
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Номенклатура.Код КАК НоменклатураКод,
	                      |	ВЗ.Номенклатура.Артикул КАК НоменклатураАртикул,
	                      |	ВЫБОР
	                      |		КОГДА СОКРЛП(ВЗ.Номенклатура.НаименованиеПолное) = """"
	                      |			ТОГДА ВЗ.Номенклатура.Наименование
	                      |		ИНАЧЕ ВЗ.Номенклатура.НаименованиеПолное
	                      |	КОНЕЦ КАК НоменклатураПредставление,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.Серия КАК Серия,
	                      |	ВЗ.Упаковка КАК Упаковка,
	                      |	ВЗ.Единица КАК Единица,
	                      |	ВЗ.Единица.Код КАК ЕдиницаИзмеренияКод,
	                      |	ВЗ.Единица.Наименование КАК ЕдиницаИзмеренияНаименование,
	                      |	ВЗ.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |	ВЗ.Количество КАК Количество,
	                      |	ВЗ.Цена КАК Цена,
	                      |	ВЗ.Сумма КАК Сумма,
	                      |	ВЗ.СуммаСНДС КАК СуммаСНДС,
	                      |	ВЗ.СтавкаНДС КАК СтавкаНДС,
	                      |	ВЗ.СуммаНДС КАК СуммаНДС,
	                      |	ВЗ.Серия.НомерГТД КАК НомерГТД,
	                      |	ВЗ.Серия.СтранаПроисхождения КАК СтранаПроисхождения,
	                      |	ВЗ.Серия.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТ.НомерСтроки КАК НомерСтроки,
	                      |		ВТ.Номенклатура КАК Номенклатура,
	                      |		ВТ.Характеристика КАК Характеристика,
	                      |		ВТ.Серия КАК Серия,
	                      |		ВТ.Упаковка КАК Упаковка,
	                      |		ВЫБОР
	                      |			КОГДА ВТ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |				ТОГДА ВТ.Номенклатура.Единица
	                      |			ИНАЧЕ ВТ.Упаковка.Единица
	                      |		КОНЕЦ КАК Единица,
	                      |		ВТ.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |		ВТ.Количество КАК Количество,
	                      |		ВТ.Цена КАК Цена,
	                      |		ВТ.Сумма КАК Сумма,
	                      |		ВТ.СуммаСНДС КАК СуммаСНДС,
	                      |		ВТ.СтавкаНДС КАК СтавкаНДС,
	                      |		ВТ.СуммаНДС КАК СуммаНДС
	                      |	ИЗ
	                      |		ВТ КАК ВТ) КАК ВЗ");
	Запрос.УстановитьПараметр("ТЗ", ТЗТовары);
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

Функция ABCКлассификация(АКласс, ВКласс, СКласс, Данные) Экспорт
	Перем ТаблицаЗначений;
	Если Данные = Null Тогда
		Возврат Null;
	КонецЕсли;
	Если ТипЗнч(Данные) <> Тип("ДанныеГрупповойОбработкиКомпоновкиДанных") Тогда
		Сообщить(ТипЗнч(Данные));
		ВызватьИсключение "В функцию ABCКлассификация() можно передавать только объект типа ДанныеГрупповойОбработкиКомпоновкиДанных";	
	КонецЕсли;
	Если Не Данные.ВременныеДанныеОбработки.Свойство("ABCКлассификацияТаблицаЗначений", ТаблицаЗначений) Тогда
		// выполним расчет классификации один раз при первом вызове
		// а потом запомним выполненный расчет и дальше будем этот
		// расчет использовать
		ТаблицаЗначений = Данные.Данные.Скопировать();
		ТаблицаЗначений.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число"));
		Номер = 0;
		ОбщаяСумма = 0;
		Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначений Цикл
			СтрокаТаблицыЗначений.Номер = Номер;
			Номер = Номер + 1;
			Если СтрокаТаблицыЗначений[0] <> NULL Тогда
				ОбщаяСумма = ОбщаяСумма + СтрокаТаблицыЗначений[0];
			КонецЕсли;
		КонецЦикла;
		ТаблицаЗначений.Сортировать(ТаблицаЗначений.Колонки[0].Имя + " Убыв");
		ТаблицаЗначений.Индексы.Добавить("Номер");
		НакопленнаяСумма = 0;
		ИндексКлассаA = Неопределено;
		ИндексКлассаB = Неопределено;
		Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначений Цикл
			Если СтрокаТаблицыЗначений[0] <> NULL Тогда
				НакопленнаяСумма = НакопленнаяСумма + СтрокаТаблицыЗначений[0];
			КонецЕсли;
			Если ОбщаяСумма = 0 Тогда
				Процент = 1;
			Иначе
				Процент = НакопленнаяСумма / ОбщаяСумма;
			КонецЕсли;
			Если Процент > (АКласс / 100) Тогда
				Если ИндексКлассаA = Неопределено Тогда
					ИндексКлассаA = ТаблицаЗначений.Индекс(СтрокаТаблицыЗначений);
				ИначеЕсли Процент >= (АКласс+ВКласс) / 100 Тогда
					Если ИндексКлассаB = Неопределено Тогда
						ИндексКлассаB = ТаблицаЗначений.Индекс(СтрокаТаблицыЗначений);
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Данные.ВременныеДанныеОбработки.Вставить("ABCКлассификацияТаблицаЗначений", ТаблицаЗначений);
		Данные.ВременныеДанныеОбработки.Вставить("ABCКлассификацияИндексКлассаA", ИндексКлассаA);
		Данные.ВременныеДанныеОбработки.Вставить("ABCКлассификацияИндексКлассаB", ИндексКлассаB);
	КонецЕсли;
	Если Данные.ТекущийЭлемент = Неопределено Тогда
		// Итог по группировке.
		Возврат Null;
	Иначе
		Строка = ТаблицаЗначений.Найти(Данные.Данные.Индекс(Данные.ТекущийЭлемент), "Номер");
		Если Строка = Неопределено Тогда
			Возврат Null;
		Иначе
			ИндексА = Данные.ВременныеДанныеОбработки.ABCКлассификацияИндексКлассаA;
			ИндексВ = Данные.ВременныеДанныеОбработки.ABCКлассификацияИндексКлассаB;
			////////////////////////////////////////
			Индекс = ТаблицаЗначений.Индекс(Строка);
			Если ИндексА <> Неопределено И Индекс <= ИндексА Тогда
				Возврат "A - класс";
				//Возврат Перечисления.ABCКлассификация.АКласс;
			ИначеЕсли ИндексВ <> Неопределено И Индекс <= ИндексВ Тогда
				Возврат "B - класс";
				//Возврат Перечисления.ABCКлассификация.BКласс;
			Иначе
				Возврат "C - класс";
				//Возврат Перечисления.ABCКлассификация.CКласс;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ABCКлассификацияРасш(АКласс, ВКласс, СКласс, Данные) Экспорт
	Перем ТаблицаЗначений;
	Если Данные = Null Тогда
		Возврат Null;
	КонецЕсли;
	Если ТипЗнч(Данные) <> Тип("ДанныеГрупповойОбработкиКомпоновкиДанных") Тогда
		Сообщить(ТипЗнч(Данные));
		ВызватьИсключение "В функцию ABCКлассификация() можно передавать только объект типа ДанныеГрупповойОбработкиКомпоновкиДанных";	
	КонецЕсли;
	Если Не Данные.ВременныеДанныеОбработки.Свойство("ABCКлассификацияТаблицаЗначений", ТаблицаЗначений) Тогда
		// выполним расчет классификации один раз при первом вызове
		// а потом запомним выполненный расчет и дальше будем этот
		// расчет использовать
		ТаблицаЗначений = Данные.Данные.Скопировать();
		ТаблицаЗначений.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число"));
		ТаблицаЗначений.Колонки.Добавить("Номер1", Новый ОписаниеТипов("Число"));
		ТаблицаЗначений.Колонки.Добавить("Номер2", Новый ОписаниеТипов("Число"));
		ТаблицаЗначений.Колонки.Добавить("Номер3", Новый ОписаниеТипов("Число"));
		Номер = 0;
		ОбщаяСумма = 0;
		Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначений Цикл
			СтрокаТаблицыЗначений.Номер = Номер;
			Номер = Номер + 1;
			//Если СтрокаТаблицыЗначений[0] <> NULL Тогда
			//	ОбщаяСумма = ОбщаяСумма + СтрокаТаблицыЗначений[0];
			//КонецЕсли;
		КонецЦикла;
		Для Н = 1 по 3 Цикл
			ИндексКолонки = Н - 1;
			ОбщаяСумма = ТаблицаЗначений.Итог(ТаблицаЗначений.Колонки[ИндексКолонки].Имя);
			ТаблицаЗначений.Сортировать(ТаблицаЗначений.Колонки[ИндексКолонки].Имя + " Убыв");
			ТаблицаЗначений.Индексы.Добавить("Номер1");
			ТаблицаЗначений.Индексы.Добавить("Номер2");
			ТаблицаЗначений.Индексы.Добавить("Номер3");
			НакопленнаяСумма = 0;
			ИндексКлассаA = Неопределено;
			ИндексКлассаB = Неопределено;
			Данные.ВременныеДанныеОбработки.Вставить("ABCКлассификацияТаблицаЗначений", ТаблицаЗначений);
			Номер = 0;
			процентПосчитан = Ложь;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначений Цикл
				СтрокаТаблицыЗначений["Номер"+Н] = Номер;
				Номер = Номер + 1;
				Если Не процентПосчитан Тогда 
					Если СтрокаТаблицыЗначений[ИндексКолонки] <> NULL Тогда
						НакопленнаяСумма = НакопленнаяСумма + СтрокаТаблицыЗначений[ИндексКолонки];
					КонецЕсли;
					Если ОбщаяСумма = 0 Тогда
						Процент = 1;
					Иначе
						Процент = НакопленнаяСумма / ОбщаяСумма;
					КонецЕсли;
					Если Процент > (АКласс / 100) Тогда
						Если ИндексКлассаA = Неопределено Тогда
							ИндексКлассаA = СтрокаТаблицыЗначений["Номер"+Н]; //ТаблицаЗначений.Индекс(СтрокаТаблицыЗначений);
						ИначеЕсли Процент >= (АКласс+ВКласс) / 100 Тогда
							Если ИндексКлассаB = Неопределено Тогда
								ИндексКлассаB = СтрокаТаблицыЗначений["Номер"+Н]; //ТаблицаЗначений.Индекс(СтрокаТаблицыЗначений);
							КонецЕсли;
							процентПосчитан = Истина; //Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Данные.ВременныеДанныеОбработки.Вставить("ABCКлассификацияИндексКлассаA"+"_"+ИндексКолонки, ИндексКлассаA);
			Данные.ВременныеДанныеОбработки.Вставить("ABCКлассификацияИндексКлассаB"+"_"+ИндексКолонки, ИндексКлассаB);
		КонецЦикла;
	КонецЕсли;
	Если Данные.ТекущийЭлемент = Неопределено Тогда
		// Итог по группировке.
		Возврат Null;
	Иначе
		Строка = ТаблицаЗначений.Найти(Данные.Данные.Индекс(Данные.ТекущийЭлемент), "Номер");
		//НомерСтроки = Данные.Данные.Индекс(Данные.ТекущийЭлемент);
		Если Строка = Неопределено Тогда
			Возврат Null;
		Иначе
			Класс = "";
			Для Н = 1 по 3 Цикл 
				ИндексКолонки = Н - 1;
				//ТаблицаЗначений.Сортировать(ТаблицаЗначений.Колонки[ИндексКолонки].Имя + " Убыв");
				ИндексА = 0;
				ИндексВ = 0;
				Данные.ВременныеДанныеОбработки.Свойство("ABCКлассификацияИндексКлассаA"+"_"+ИндексКолонки,ИндексА);
				Данные.ВременныеДанныеОбработки.Свойство("ABCКлассификацияИндексКлассаB"+"_"+ИндексКолонки,ИндексВ);
				НомерСтроки = Строка["Номер"+Н];
				////////////////////////////////////////
				//Индекс = ТаблицаЗначений.Индекс(Строка);
				//Если ИндексА <> Неопределено И Индекс <= ИндексА Тогда
				//	Класс = Класс + "A";
				//	//Возврат Перечисления.ABCКлассификация.АКласс;
				//ИначеЕсли ИндексВ <> Неопределено И Индекс <= ИндексВ Тогда
				//	Класс = Класс + "B";
				//	//Возврат Перечисления.ABCКлассификация.BКласс;
				//Иначе
				//	Класс = Класс + "C";
				//	//Возврат Перечисления.ABCКлассификация.CКласс;
				//КонецЕсли;
				Если ИндексА <> Неопределено И НомерСтроки <= ИндексА Тогда
					Класс = Класс + "A";
					//Возврат Перечисления.ABCКлассификация.АКласс;
				ИначеЕсли ИндексВ <> Неопределено И НомерСтроки <= ИндексВ Тогда
					Класс = Класс + "B";
					//Возврат Перечисления.ABCКлассификация.BКласс;
				Иначе
					Класс = Класс + "C";
					//Возврат Перечисления.ABCКлассификация.CКласс;
				КонецЕсли;
			КонецЦикла;
			Возврат Класс + " - класс";
		КонецЕсли;
	КонецЕсли;
КонецФункции

#КонецОбласти
